Revit 2027 API
BuiltInFailures.MultiReferenceAnnotationFailures.MultiReferenceAnnotationReferenceCategoryForcesDeletion Property
 Changing the reference category will cause instances of this annotation type to be deleted, because they no longer match their references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultiReferenceAnnotationReferenceCategoryForcesDeletion { get; }
Public Shared ReadOnly Property MultiReferenceAnnotationReferenceCategoryForcesDeletion As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultiReferenceAnnotationReferenceCategoryForcesDeletion {
	FailureDefinitionId^ get ();
}
static member MultiReferenceAnnotationReferenceCategoryForcesDeletion : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MultiReferenceAnnotationFailures Class
Autodesk.Revit.DB Namespace